Repository: BackupTheBerlios/openfm-svn
Catalog: trunk/po/*.po
Languages: ru

source: String is too small
ru: Слишком короткая строка

source: First field of string should be sign '+' or '-'!
ru: Первым полем в строке должен быть знак '+' или '-'!

source: Separator for fields should be sign '|'!
ru: Разделителем для полей должен быть знак '|'!

source: Separator after 3rd field not found!
ru: Не найден разделитель после 3-его поля!

source: Separator after 4th field not found!
ru: Не найден разделитель после 4-ого поля!

source: Date should consist of digitals only!
ru: Дата должна состоять только из чисел!

source: Separator for date should be sign '.'!
ru: Разделителем для даты является знак '.'!

source: Invalid number of day
ru: Неправильный день месяца

source: Invalid number of month
ru: Неправильный номер месяца

source: Invalid number of year! Year should be more then 0
ru: Неправильный год! Год должен быть больше нуля

source: Invalid day of month in leap year
ru: Неправильный день месяца в високосном году

source: Invalid day of month
ru: Неправильный день месяца

source: error occurs
ru: произошла ошибка

source: Date in future
ru: Дата в будущем

source: -> Trying to get statistics for %s file
ru: -> Получение информации для файла %s

source: File %s isn't regular file!
ru: Файл %s не является обычным файлом!

source: Open data file
ru: Открываю файл с данными

source: Lock file
ru: Блокирую файл

source: cannot lock file for writing
ru: не удалось заблокировать файл для записи

source: Writing data
ru: Записываю данные

source: Unlock file
ru: Разблокирование файла

source: cannot unlock file
ru: не удалось разблокировать файл

source: Flushing data to disk
ru: Сбрасываю данные на диск

source: Close file
ru: Закрываю файл

source: %s: Your private financial manager Usage: %s [option] -v enable verbose mode -V print version and exit -h print this help and exit
ru: %s: Ваш личный финансовый менеджер Использование: %s [опция] -v включить режим детализации действий -V вывести версию програмы и выйти -h вывести эту помощь и выйти

source: version
ru: версия

source: return
ru: вернула

source: NOTE: Set verbose level to
ru: Внимание: Уровень режима детализации действий установлен в

source: Using default data file...
ru: Используется файл с данными по умолчанию...

source: cannot allocate memory
ru: не удалось выделить память

source: Not enough arguments for action
ru: Недостаточно аргументов для действия

source: Wrong argument for action
ru: Неверный аргумент для действия

source: cannot get value for $HOME variable
ru: не удалось получить значение переменной $HOME

source: cannot find user with uid
ru: не удалось найти пользователя с идентификатором

source: Your home directory is
ru: Ваш домашний каталог

source: Writing data was truncated. Please notify the author about this incident!
ru: Во время записи данные были сокращены. Пожалуйста сообщите автору об этом инциденте!

source: Failed to write to the character string
ru: Не удалось записать в символьную строку

source: Failed to open file
ru: Ошибка при открытии файла

source: Reading data...
ru: Чтение данных...

source: Too many wrong lines in database. Exit.
ru: Слишком много некорректных записей в базе. Выхожу.

source: -> Reads %lu strings
ru: -> Прочитано %lu строк

source: and %lu records
ru: и %lu записей

source: from data file
ru: из файла

source: Finance statistics: Profit: %8.2f Costs: %8.2f Balance: %8.2f
ru: Отчет: Доход: %8.2f Расход: %8.2f Остаток: %8.2f
